<a href="https://colab.research.google.com/github/Sreekar-Kandhadai/pyspark-interview-questions/blob/main/Imp8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
Find the list of employees who share the same salary with atleast one other employee
in the same dept.output should be ordered by department_id

data = [
 (102, "sohan", 3000, 11),
 (102, "rohan", 4000, 12),
 (103, "mohan", 5000, 13),
 (104, "cat", 3000, 11),
 (105, "suresh", 4000, 12),
 (109, "mahesh", 7000, 12),
 (108, "kamal", 8000, 11)
]

schema = ['emp_id','name','salary','dpt_id']

In [8]:

from pyspark.sql import SparkSession

from pyspark.sql.functions import *

from pyspark.sql.window import Window

spark=SparkSession.builder.appName("learning").getOrCreate()


data=[
 (102, "sohan", 3000, 11),
 (102, "rohan", 4000, 12),
 (103, "mohan", 5000, 13),
 (104, "cat", 3000, 11),
 (105, "suresh", 4000, 12),
 (109, "mahesh", 7000, 12),
 (108, "kamal", 8000, 11)
]

schema=['emp_id','name','salary','dpt_id']

df=spark.createDataFrame(data,schema)

df.show()

window_spec=Window.partitionBy('dpt_id','salary')

df1=df.withColumn('cnt_emp',count('emp_id').over(window_spec)).filter("cnt_emp > '1'").orderBy('dpt_id')

df1.show()

+------+------+------+------+
|emp_id|  name|salary|dpt_id|
+------+------+------+------+
|   102| sohan|  3000|    11|
|   102| rohan|  4000|    12|
|   103| mohan|  5000|    13|
|   104|   cat|  3000|    11|
|   105|suresh|  4000|    12|
|   109|mahesh|  7000|    12|
|   108| kamal|  8000|    11|
+------+------+------+------+

+------+------+------+------+-------+
|emp_id|  name|salary|dpt_id|cnt_emp|
+------+------+------+------+-------+
|   102| sohan|  3000|    11|      2|
|   104|   cat|  3000|    11|      2|
|   102| rohan|  4000|    12|      2|
|   105|suresh|  4000|    12|      2|
+------+------+------+------+-------+